IDEA Open Model
MaterialBoltGradeHKG Class
Compatible with IDEA StatiCa Beta 20.0
 Material bolt grade
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MaterialBoltGrade
 IdeaRS.OpenModel.Material.MaterialBoltGradeHKG
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class MaterialBoltGradeHKG : MaterialBoltGrade
Public Class MaterialBoltGradeHKG
	Inherits MaterialBoltGrade
The MaterialBoltGradeHKG type exposes the following members.
Constructors
Name | Description
MaterialBoltGradeHKG
Initializes a new instance of the MaterialBoltGradeHKG class
Top
Properties
Name | Description
Code
 Design code
 (Inherited from MaterialBoltGrade.)
E
 Young's modulus
 (Inherited from Material.)
Elongation
 Elongation after fracture - for 20% elongation use value 0.2
 (Inherited from MaterialBoltGrade.)
fub
 Ultimate tensile strength
 (Inherited from MaterialBoltGrade.)
fyb
 Yield strength
 (Inherited from MaterialBoltGrade.)
G
 Shear modulus
 (Inherited from Material.)
Id
 Element Id
 (Inherited from OpenElementId.)
IsDefaultMaterial
 True if material is default material from the code
 (Inherited from Material.)
LoadFromLibrary
 Load from library - try override properties from library find material by name
 (Inherited from Material.)
MprlElementID
 Name fo the bolt grade in MPRL database
 (Inherited from MaterialBoltGrade.)
MprlTableID
 Unique ID of MPRL database table where the bolt grade was taken from.
 (Inherited from MaterialBoltGrade.)
Name
 Name of material
 (Inherited from Material.)
OrderInCode
 Order of this material in the code
 (Inherited from Material.)
Pbb
 Design bearing strength
Poisson
 Poisson's ratio
 (Inherited from Material.)
Ps
 Design shear strength
Pt
 Design tension strength
SpecificHeat
 Specific heat capacity
 (Inherited from Material.)
StateOfThermalConductivity
 State of thermal conductivity curvature
 (Inherited from Material.)
StateOfThermalExpansion
 State of thermal expansion curvature
 (Inherited from Material.)
StateOfThermalSpecificHeat
 State of thermal specific heat curvature
 (Inherited from Material.)
StateOfThermalStrain
 State of thermal strain curvature
 (Inherited from Material.)
StateOfThermalStressStrain
 State of thermal specific stress-strain curvature
 (Inherited from Material.)
ThermalConductivity
 Thermal conductivity
 (Inherited from Material.)
ThermalExpansion
 Thermal expansion
 (Inherited from Material.)
UnitMass
 Unit weight
 (Inherited from Material.)
UserThermalConductivityCurvature
 User-defined curvature for thermal conductivity curvature { x = Θ[K], y = λc[W/(m K)] }
 (Inherited from Material.)
UserThermalExpansionCurvature
 User-defined curvature for thermal expansion curvature { x = Θ[K], y = γ[K-1] }
 (Inherited from Material.)
UserThermalSpecificHeatCurvature
 User-defined curvature for thermal specific heat { x = Θ[K], y = cp[J/(kg K)] }
 (Inherited from Material.)
UserThermalStrainCurvature
 User-defined curvature for thermal strain curvature { x = Θ[K], y = εc[Δl/l] }
 (Inherited from Material.)
UserThermalStressStrainCurvature
 User-defined curvature for thermal stress,strain { Temperature = Θ[K], {x = ε[-], y = σ[Pa]}}
 (Inherited from Material.)
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace